{
    "title": "Resume",
    "topLevel": "true",
    "lastUpdated": "February 3, 2025",
    "description": "Skills and background",
    "sections":
    [
        {
            "heading": "Skills",
            "content":
            [
                "HTML, CSS, PHP, Laravel, JavaScript, Node.js, Vue, React, Git, MySQL, Figma, Affinity Designer, Wordpress"
            ]
        },
        {
            "heading": "Recent Projects",
            "content":
            [
                {
                    "title": "Title",
                    "description": "description - key results and high level summary",
                    "stack": "Stack",
                    "url": "#",
                    "text": "Link"
                }
            ]
        },
        {
            "heading": "Work Experience",
            "content":
            [
                {
                    "role": "Central Selling Associate",
                    "company": "Lowe’s Companies Inc",
                    "start": "May 2023",
                    "end": "Present",
                    "responsibilities":
                    [
                        "Exceeded performance metrics by over 80%, surpassing $1.5 million in remote installed-sales",
                        "Proactively identified and implemented process improvements within the centralized selling model, contributing valuable insights and recommendations to enhance the customer experience and streamline operations",
                        "Successfully delivered prompt and knowledgeable responses to inquiries, resolved issues efficiently, and ensured the successful completion of projects",
                        "Collaborated with cross-functional teams to optimize work processes and maintain effective communication, showcasing strong teamwork and collaboration skills"
                    ]
                },
                {
                    "role": "Central Quoting Coordinator",
                    "company": "Lowe’s Companies Inc",
                    "start": "Oct. 2017",
                    "end": "May 2023",
                    "responsibilities":
                    [
                        "Provided hands-on technical assistance and business support for cross-functional teams",
                        "Assessed processes to uncover bottlenecks and implement solutions for smoother operations",
                        "Delivered timely and accurate estimates to drive increase sales and maintain service-level agreement",
                        "Provided 1-on-1 mentorship for colleagues, facilitating the dissemination of best practices and product knowledge and fostering a collaborative team environment"
                    ]
                }
            ]
        },
        {
            "heading": "Education",
            "content":
            [
                {
                    "location": "Perpetual Education",
                    "subject": "Design for the Web"
                },
                {
                    "location": "The University of North Carolina at Greensboro",
                    "subject": "B.S. Information Systems"
                }
            ]
        },
        {
            "heading": "Interests",
            "content":
            [
                "Musicology, reading, modding The Sims 2"
            ]
        }
    ]
}