{
    "title": "Kitchen Sink Blog Post",
    "slug": "kitchen-sink-blog-post-2",
    "description": "My biggest fear right now is that I’ll wake up and this conversation won’t be a dream.",
    "published": "January 1, 2025",
    "lastUpdated": "January 6, 2025",
    "links":
    [
        {
            "url": "#",
            "text": "Read on Substack"
        }
    ],
    "modules":
    [
        {
            "module": "generic-text",
            "props":
            {
                "content": "<p>There's also the part about working a stupid job and begging your parents for money. Aren't you a little worried that there may be a hell? Does that mean these are the best years of our lives? I hope not. What do you plan to do about it? You can't ignore me! I pay your salary.</p><p>Now, while you're on a roll, am I the sort of man who you suppose believes in underwriting the indolence of students who already display the work habits of garden slugs? <a href=\"#\">The dark side of life</a>. The thoughts other people try not to have. That's your thing, right? Facing the void?</p><p> Yes, I'm sure you're dealing with it. I'm not dealing with it! Isn't modeling about dropping out of school to pursue a career based solely on your youth and your looks, both of which are inevitably declared over by age twenty-five? This color looks nothing like melon. It's way too pink. So let's just walk in and meet them straight on. They're not going to intimidate us. You sure that's okay with your doctor? I mean, you're not popular, but you're not so unpopular that you couldn't come to my party Saturday night.</p><h2>Heading level 2</h2><ul><li>UL item one</li><li>UL item two</li><li>UL item three</li></ul><p>This is like that R.E.M. video, except you can't read anyone's mind. She's got a dark, threatened look. She never cracked no books. La-la-la... Actually, I'm sending an erotic letter to a female inmate I met on the Internet. I think she's female. I have two econ problem sets and a paper on Kerouac that I have to get to the delivery guy by 9:00 P.M.... and then, I quit. If they start to drive you nuts, tell them you know this great game called \"cemetery.\" They have to lie on the floor and pretend they're dead. The first one to move or make a sound loses. Did someone flash the bimbo signal? Your Mom sounds a little nutty but she's making perfect sense.</p><p>Does that mean these are the best years of our lives? I hope not. Find some other way to feel. Then you won't feel sad. He can drive, he never has to take a pop quiz, and he can order a mimosa anytime he wants. What's the problem? I knew I should've stayed home. Um, I'm just a freshman and I... we're not really supposed to... I get headaches sometimes 'cause I'm allergic to things. And I... I sort of have to go now, bye. <a href=\"#\">What do you plan to do about it?</a> You can't ignore me! I pay your salary. Are you sleeping in there? You're not a real cop, you know! The Doo Dad Shop. Oh, good. I've always wanted my own doo dad.</p><picture><img src=\"https://imgix.ranker.com/list_img_v2/19668/1759668/original/the-best-daria-episodes-of-all-time-u1?fit=crop&fm=pjpg&q=80&dpr=2&w=1200&h=720\"></picture><p>An encyclopedia is an unusual product for a supermodel to promote, isn't it? You seem awfully young to be doing this kind of work. Daria, would you say sleeping with a guitar in your hands counts as practicing? ...As long as you don't drop it. Now, while you're on a roll, am I the sort of man who you suppose believes in underwriting the indolence of students who already display the work habits of garden slugs? Uh, are we going to need to know this, or is this, like, personal advice or something? She said it was wrong to encourage cheaters and to profit from them. ...So, she's giving up being a lawyer? See? You don't want to do poetry for this crowd.</p><ol><li>OL item one</li><li>OL item two</li><li >OL item three</li></ol><p>You know how there are people who go to car races on the chance that they might see a crash? You seem pretty comfortable with the brain-dead. <a href=\"#\">So, let's go to a party</a>. I should really make pancakes more often. The batter's so sensual. Friends don't let short-waisted friends wear hip-huggers. Fourteen people pretended not to see me, five crossed the street to get away, seven ran, three called the police, and I'm pretty sure this one guy fired a shot. A weekend on the world's tallest pile of seagull droppings is starting to look pretty good. All right. I had a magnetic device implanted in my head.</p><h2>Heading level 2</h2><p>You always see the downside, don't you? I could pass the test, but I like having low self-esteem. It makes me feel special.</p><h3>Heading level 3</h2><p>Humor may lift your spirits, Daria, but it takes a professional to lift your buttocks! Doctor's joke! Have a nice day girls. And remember, money can make anyone look beautiful. Ah, Quinn, that is excellent. You appear truly to be savoring another's misfortune. Is there another tight pants sale going on at the mall? All right. I had a magnetic device implanted in my head. I know that plenty of guys want to go out with you, and plenty of girls want to go out with me, and that makes me think we should be together. Don't panic. I think we'll be able to lose each other in a crowd of ten thousand. She's God's problem now, kid.</p><p>I feel bad, but I think I should feel worse, and not feeling worse makes me feel bad all over again. All right, let's not get panicked. We're going to look at the situation calmly and objectively. Agreed? You really ought to stick to mineral water and parsley. She said it was wrong to encourage cheaters and to profit from them. ...So, she's giving up being a lawyer? He can drive, he never has to take a pop quiz, and he can order a mimosa anytime he wants. What's the problem? They made me their queen! Isn't it great?! I don't like to smile unless I have a reason.</p><h3>Heading level 3</h2><p>I hate to tell you this, but there's a big, greasy spot of peanut buttery goodness on your butt. Looks like a sandwich... and it's an antique! Your Mom sounds a little nutty but she's making perfect sense. I find the situation unbelievable myself. I'm going to the picnic, and I'm bringing asbestos insulation, brined shrimp, the cryogenically frozen head of Walt Disney, a dromedary, and... a eurocentric view of world history. Sure. And after that, I think I'll swallow glass. I hope the raging envy you're feeling won't affect our friendship.</p><p>And don't fashion people squander their lives loudly worshiping all that is superficial and meaningless while the planet keeps riding a roller coaster to hell? A weekend on the world's tallest pile of seagull droppings is starting to look pretty good. As soon as we get there, we find a bar, and we don't leave it until we're unconscious. Don't worry. I don't have low self-esteem. It's a mistake. I have low esteem for everyone else. Maybe I will end up a townie doing Doors covers. I mean, who's to say, right? Did she ask you to feed her the chocolate? Maybe that one about feeling like a big misfit whom everybody hates. The other kids will really relate to that. I know I do.</p><h2>Heading level 2</h2><p>Isn't modeling about dropping out of school to pursue a career based solely on your youth and your looks, both of which are inevitably declared over by age twenty-five? Too much hero worship isn't healthy, you know. We're borrowing our drummer's van, the Tank. It's indestructible. We're out in the middle of nowhere, nobody knows we're here, we have no way to contact anyone, and our parents have gone insane. I'm going to the picnic, and I'm bringing asbestos insulation, brined shrimp, the cryogenically frozen head of Walt Disney, a dromedary, and... a eurocentric view of world history.</p><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/WVMd-TiwSBg?si=p1DF2rycV4866zi4\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe><p>Ten dollar surcharge if I have to spend more than fifteen minutes with the parents. I'm sorry, Mrs. Bennett. I can't go to the mall. I have a skin condition. Stop staring at me, you squirrel pervert! And the vocabulary word for tonight is \"indemnification.\" Ah, Quinn, that is excellent. You appear truly to be savoring another's misfortune. These buildings date from when Middleton was a colonial religious college. Back then, the all-male student body attended chapel twice a day, and endured whippings as punishment for impure thoughts. You're one of those misery chicks, always moping about what a cruel world it is, making a big deal about it so people won't notice that you're a loser.</p><blockquote>From the first time man and woman gazed upon themselves in the ripples of a sun-dappled pool, human beings have been blessed, and burdened, by awareness of their own image.</blockquote><p>There is one story in particularly that I'd like to leave you with today - a story I told when I had the great honor of speaking on Dr. And as so many generations have come to realize over the course of the two-hundred and twenty one years since a band of patriots signed that document in Philadelphia.</p><p>And as a consequence, so did I. And throughout history, Islam has demonstrated through words and deeds the possibilities of religious tolerance and racial equality. But if we choose to be bound by the past, we will never move forward.</p>"
            }
        },
        {
            "module": "projects-spotlight",
            "props":
            {
                "filter": "featured"
            }
        }
    ]
}